import 'package:flutter/material.dart';
import 'package:adobe_xd/pinned.dart';
import 'package:flutter_svg/flutter_svg.dart';
import 'package:school_delivery/ui/widgets/backgroundsmal.dart';

class Settings23 extends StatelessWidget {
  const Settings23({
    Key? key,
  }) : super(key: key);
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: const Color(0xffecefe4),
      body: Stack(
        children: <Widget>[
          BackgroundSmall(),
          Pinned.fromPins(
            Pin(size: 168.0, middle: 0.5),
            Pin(size: 167.0, start: 48.0),
            child: Container(
              decoration: const BoxDecoration(
                image: DecorationImage(
                  image: AssetImage('assets/images/schoolbus.png'),
                  fit: BoxFit.cover,
                ),
                borderRadius:
                    const BorderRadius.all(const Radius.elliptical(9999.0, 9999.0)),
              ),
            ),
          ),
          Pinned.fromPins(
            Pin(size: 163.0, end: 58.5),
            Pin(size: 35.0, middle: 0.4336),
            child: const Text(
              'المواقع السابقة',
              style: TextStyle(
                fontFamily: 'Segoe UI',
                fontSize: 26,
                color: Color(0xff000000),
              ),
              softWrap: false,
            ),
          ),
          Pinned.fromPins(
            Pin(size: 169.0, middle: 0.5527),
            Pin(size: 56.0, end: 18.0),
            child: Container(
              decoration: BoxDecoration(
                color: const Color(0xffffffff),
                borderRadius: BorderRadius.circular(37.0),
                border: Border.all(width: 1.0, color: const Color(0xff707070)),
              ),
            ),
          ),
          Pinned.fromPins(
            Pin(size: 148.0, middle: 0.5872),
            Pin(size: 35.0, end: 28.5),
            child: const Text(
              'تسجيل الخروج',
              style: TextStyle(
                fontFamily: 'Segoe UI',
                fontSize: 26,
                color: Color(0xff000000),
              ),
              softWrap: false,
            ),
          ),
          Pinned.fromPins(
            Pin(size: 168.0, end: 44.5),
            Pin(size: 35.0, middle: 0.775),
            child: const Text(
              'مشاركة التطبيق',
              style: TextStyle(
                fontFamily: 'Segoe UI',
                fontSize: 26,
                color: Color(0xff000000),
              ),
              softWrap: false,
            ),
          ),
          Pinned.fromPins(
            Pin(size: 141.0, end: 57.5),
            Pin(size: 38.0, middle: 0.6802),
            child: const Text(
              'قيم التطبيق',
              style: TextStyle(
                fontFamily: 'Segoe UI',
                fontSize: 29,
                color: Color(0xff000000),
              ),
              softWrap: false,
            ),
          ),
          const Align(
            alignment: Alignment(0.507, 0.198),
            child: SizedBox(
              width: 136.0,
              height: 38.0,
              child: Text(
                'عن التطبيق',
                style: TextStyle(
                  fontFamily: 'Segoe UI',
                  fontSize: 29,
                  color: Color(0xff000000),
                ),
                softWrap: false,
              ),
            ),
          ),
          const Align(
            alignment: Alignment(0.422, 0.057),
            child: SizedBox(
              width: 124.0,
              height: 41.0,
              child: Text(
                'الاشعارات',
                style: TextStyle(
                  fontFamily: 'Segoe UI',
                  fontSize: 31,
                  color: Color(0xff000000),
                ),
                softWrap: false,
              ),
            ),
          ),
          Pinned.fromPins(
            Pin(size: 170.0, end: -23.0),
            Pin(size: 50.0, middle: 0.3381),
            child: Container(
              decoration: BoxDecoration(
                color: const Color(0xffffffff),
                borderRadius: BorderRadius.circular(38.0),
                border: Border.all(width: 1.0, color: const Color(0xff707070)),
              ),
            ),
          ),
          Pinned.fromPins(
            Pin(size: 100.0, end: 10.0),
            Pin(size: 35.0, middle: 0.3483),
            child: const Text(
              'الاعدادات',
              style: TextStyle(
                fontFamily: 'Segoe UI',
                fontSize: 26,
                color: Color(0xff000000),
              ),
              softWrap: false,
            ),
          ),
          Pinned.fromPins(
            Pin(size: 46.3, end: 29.7),
            Pin(size: 46.3, middle: 0.4308),
            child: Stack(
              children: <Widget>[
                Stack(
                  children: <Widget>[
                    Pinned.fromPins(
                      Pin(size: 12.1, start: 4.4),
                      Pin(size: 31.4, start: 6.4),
                      child: SvgPicture.string(
                        _svg_hc83r6,
                        allowDrawingOutsideViewBox: true,
                        fit: BoxFit.fill,
                      ),
                    ),
                    Pinned.fromPins(
                      Pin(size: 13.8, middle: 0.5088),
                      Pin(start: 6.4, end: 6.4),
                      child: SvgPicture.string(
                        _svg_qf3795,
                        allowDrawingOutsideViewBox: true,
                        fit: BoxFit.fill,
                      ),
                    ),
                    Pinned.fromPins(
                      Pin(size: 12.1, end: 3.8),
                      Pin(size: 31.4, end: 6.5),
                      child: SvgPicture.string(
                        _svg_d3pyk,
                        allowDrawingOutsideViewBox: true,
                        fit: BoxFit.fill,
                      ),
                    ),
                    SizedBox.expand(
                        child: SvgPicture.string(
                      _svg_lfbv7,
                      allowDrawingOutsideViewBox: true,
                      fit: BoxFit.fill,
                    )),
                  ],
                ),
              ],
            ),
          ),
          Pinned.fromPins(
            Pin(size: 50.2, end: 29.3),
            Pin(size: 48.6, middle: 0.5251),
            child: Stack(
              children: <Widget>[
                Align(
                  alignment: const Alignment(-0.09, 0.273),
                  child: SizedBox(
                    width: 27.0,
                    height: 26.0,
                    child: Stack(
                      children: <Widget>[
                        Stack(
                          children: <Widget>[
                            Pinned.fromPins(
                              Pin(start: 4.9, end: 4.9),
                              Pin(size: 17.6, start: 3.2),
                              child: SvgPicture.string(
                                _svg_kvl8nu,
                                allowDrawingOutsideViewBox: true,
                                fit: BoxFit.fill,
                              ),
                            ),
                            Pinned.fromPins(
                              Pin(size: 5.0, middle: 0.5004),
                              Pin(size: 1.5, start: 2.2),
                              child: SvgPicture.string(
                                _svg_sbycsg,
                                allowDrawingOutsideViewBox: true,
                                fit: BoxFit.fill,
                              ),
                            ),
                            Pinned.fromPins(
                              Pin(size: 6.4, middle: 0.5),
                              Pin(size: 2.2, end: 2.2),
                              child: SvgPicture.string(
                                _svg_a7ocmc,
                                allowDrawingOutsideViewBox: true,
                                fit: BoxFit.fill,
                              ),
                            ),
                            SizedBox.expand(
                                child: SvgPicture.string(
                              _svg_s9d3he,
                              allowDrawingOutsideViewBox: true,
                              fit: BoxFit.fill,
                            )),
                          ],
                        ),
                      ],
                    ),
                  ),
                ),
                Stack(
                  children: <Widget>[
                    Stack(
                      children: <Widget>[
                        Pinned.fromPins(
                          Pin(size: 12.5, end: 4.2),
                          Pin(size: 12.2, start: 4.0),
                          child: SvgPicture.string(
                            _svg_fbrgq1,
                            allowDrawingOutsideViewBox: true,
                            fit: BoxFit.fill,
                          ),
                        ),
                        Padding(
                          padding: const EdgeInsets.fromLTRB(4.2, 6.1, 6.3, 4.1),
                          child: SizedBox.expand(
                              child: SvgPicture.string(
                            _svg_jjn0al,
                            allowDrawingOutsideViewBox: true,
                            fit: BoxFit.fill,
                          )),
                        ),
                        SizedBox.expand(
                            child: SvgPicture.string(
                          _svg_bon4nd,
                          allowDrawingOutsideViewBox: true,
                          fit: BoxFit.fill,
                        )),
                      ],
                    ),
                  ],
                ),
              ],
            ),
          ),
          Pinned.fromPins(
            Pin(size: 33.7, end: 37.3),
            Pin(size: 42.1, middle: 0.6144),
            child: Stack(
              children: <Widget>[
                Stack(
                  children: <Widget>[
                    SizedBox.expand(
                        child: SvgPicture.string(
                      _svg_ki4182,
                      allowDrawingOutsideViewBox: true,
                      fit: BoxFit.fill,
                    )),
                    Pinned.fromPins(
                      Pin(size: 8.4, middle: 0.5),
                      Pin(size: 1.0, start: 7.4),
                      child: SvgPicture.string(
                        _svg_czt67,
                        allowDrawingOutsideViewBox: true,
                        fit: BoxFit.fill,
                      ),
                    ),
                    Pinned.fromPins(
                      Pin(size: 6.5, middle: 0.5),
                      Pin(size: 6.5, end: 6.1),
                      child: SvgPicture.string(
                        _svg_b8k0ez,
                        allowDrawingOutsideViewBox: true,
                        fit: BoxFit.fill,
                      ),
                    ),
                  ],
                ),
              ],
            ),
          ),
          Pinned.fromPins(
            Pin(size: 40.6, end: 35.4),
            Pin(size: 38.3, middle: 0.6936),
            child: Stack(
              children: <Widget>[
                SizedBox.expand(
                    child: SvgPicture.string(
                  _svg_u1tex1,
                  allowDrawingOutsideViewBox: true,
                  fit: BoxFit.fill,
                )),
              ],
            ),
          ),
          Pinned.fromPins(
            Pin(size: 40.3, end: 37.7),
            Pin(size: 40.3, middle: 0.7743),
            child: Stack(
              children: <Widget>[
                Stack(
                  children: <Widget>[
                    Pinned.fromPins(
                      Pin(size: 6.1, end: 5.7),
                      Pin(size: 10.3, middle: 0.3457),
                      child: SvgPicture.string(
                        _svg_puhlg,
                        allowDrawingOutsideViewBox: true,
                        fit: BoxFit.fill,
                      ),
                    ),
                    Pinned.fromPins(
                      Pin(size: 6.0, start: 5.9),
                      Pin(size: 10.3, middle: 0.3485),
                      child: SvgPicture.string(
                        _svg_c92645,
                        allowDrawingOutsideViewBox: true,
                        fit: BoxFit.fill,
                      ),
                    ),
                    Pinned.fromPins(
                      Pin(size: 12.7, middle: 0.4994),
                      Pin(size: 1.5, end: 3.6),
                      child: SvgPicture.string(
                        _svg_vhpsw0,
                        allowDrawingOutsideViewBox: true,
                        fit: BoxFit.fill,
                      ),
                    ),
                    Pinned.fromPins(
                      Pin(size: 9.3, middle: 0.5033),
                      Pin(size: 9.3, start: 3.6),
                      child: SvgPicture.string(
                        _svg_j88te,
                        allowDrawingOutsideViewBox: true,
                        fit: BoxFit.fill,
                      ),
                    ),
                    Pinned.fromPins(
                      Pin(size: 9.3, start: 3.4),
                      Pin(size: 9.3, middle: 0.7787),
                      child: SvgPicture.string(
                        _svg_tpz8b1,
                        allowDrawingOutsideViewBox: true,
                        fit: BoxFit.fill,
                      ),
                    ),
                    Pinned.fromPins(
                      Pin(size: 9.3, end: 3.4),
                      Pin(size: 9.3, middle: 0.7787),
                      child: SvgPicture.string(
                        _svg_aphwv,
                        allowDrawingOutsideViewBox: true,
                        fit: BoxFit.fill,
                      ),
                    ),
                    SizedBox.expand(
                        child: SvgPicture.string(
                      _svg_adb2rz,
                      allowDrawingOutsideViewBox: true,
                      fit: BoxFit.fill,
                    )),
                  ],
                ),
              ],
            ),
          ),
          Align(
            alignment: const Alignment(-0.656, 0.083),
            child: SizedBox(
              width: 28.0,
              height: 24.0,
              child: Stack(
                children: <Widget>[
                  Stack(
                    children: <Widget>[
                      Padding(
                        padding: const EdgeInsets.fromLTRB(0.0, 1.2, 2.0, 1.2),
                        child: SizedBox.expand(
                            child: SvgPicture.string(
                          _svg_t4emgm,
                          allowDrawingOutsideViewBox: true,
                          fit: BoxFit.fill,
                        )),
                      ),
                      Padding(
                        padding: const EdgeInsets.fromLTRB(4.4, 0.0, 0.0, 0.0),
                        child: SizedBox.expand(
                            child: SvgPicture.string(
                          _svg_e4iue3,
                          allowDrawingOutsideViewBox: true,
                          fit: BoxFit.fill,
                        )),
                      ),
                    ],
                  ),
                ],
              ),
            ),
          ),
        ],
      ),
    );
  }
}

const String _svg_hc83r6 =
    '<svg viewBox="4.4 6.4 12.1 31.4" ><path transform="translate(367.94, 281.82)" d="M -351.4392700195312 -275.3900451660156 L -351.4392700195312 -247.7719421386719 C -352.0629272460938 -247.7719421386719 -352.6865844726562 -247.6115417480469 -353.2389221191406 -247.3086090087891 L -357.7647399902344 -244.7249603271484 C -360.9185485839844 -242.9075622558594 -363.52001953125 -244.4220275878906 -363.52001953125 -248.0747833251953 L -363.52001953125 -266.8372802734375 C -363.4309692382812 -268.1914978027344 -362.7182006835938 -269.438720703125 -361.5778503417969 -270.1693115234375 L -353.2389831542969 -274.9445190429688 C -352.6865844726562 -275.2296142578125 -352.0629272460938 -275.3721923828125 -351.4392700195312 -275.3900451660156 Z" fill="#4154b5" fill-opacity="0.4" stroke="none" stroke-width="1" stroke-opacity="0.4" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';
const String _svg_qf3795 =
    '<svg viewBox="16.5 6.4 13.8 33.4" ><path transform="translate(373.24, 281.83)" d="M -342.9131164550781 -269.6221313476562 L -342.9131164550781 -242.0039978027344 C -343.5545654296875 -241.9683685302734 -344.1781921386719 -242.0930328369141 -344.7662353515625 -242.3425140380859 L -354.8869323730469 -247.4028778076172 C -355.4748840332031 -247.6701354980469 -356.0985412597656 -247.7948913574219 -356.739990234375 -247.7592620849609 L -356.739990234375 -275.3773803710938 C -356.0986022949219 -275.4130249023438 -355.4749755859375 -275.2882690429688 -354.8869323730469 -275.02099609375 L -344.7662353515625 -269.9428100585938 C -344.1960144042969 -269.7112426757812 -343.5545654296875 -269.5864868164062 -342.9131164550781 -269.6221313476562 L -342.9131164550781 -269.6221313476562 Z" fill="#4154b5" stroke="none" stroke-width="1" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';
const String _svg_d3pyk =
    '<svg viewBox="30.3 8.4 12.1 31.4" ><path transform="translate(379.31, 282.68)" d="M -336.8993225097656 -270.1696472167969 L -336.8993225097656 -251.4249877929688 C -336.9706420898438 -250.0707702636719 -337.701171875 -248.8235778808594 -338.8414916992188 -248.0929870605469 L -347.180419921875 -243.3177490234375 C -347.7327270507812 -243.0326232910156 -348.3563842773438 -242.89013671875 -348.9800415039062 -242.8722839355469 L -348.9800415039062 -270.4903869628906 C -348.3563842773438 -270.4903869628906 -347.7327270507812 -270.6507263183594 -347.180419921875 -270.9536743164062 L -342.654541015625 -273.5373229980469 C -339.500732421875 -275.3369140625 -336.8993225097656 -273.8223266601562 -336.8993225097656 -270.1696472167969 Z" fill="#4154b5" fill-opacity="0.4" stroke="none" stroke-width="1" stroke-opacity="0.4" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';
const String _svg_lfbv7 =
    '<svg viewBox="0.0 0.0 46.3 46.3" ><path transform="translate(366.0, 279.0)" d="M -365.9999694824219 -278.9999694824219 L -319.7441101074219 -278.9999694824219 L -319.7441101074219 -232.7441101074219 L -365.9999694824219 -232.7441101074219 L -365.9999694824219 -278.9999694824219 Z" fill="none" stroke="none" stroke-width="1" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';
const String _svg_kvl8nu =
    '<svg viewBox="4.9 3.2 17.4 17.6" ><path transform="translate(368.93, 331.98)" d="M -347.0261840820312 -316.0962524414062 L -348.1484375 -317.9150390625 C -348.4193420410156 -318.4181823730469 -348.5740966796875 -318.979248046875 -348.593505859375 -319.5403747558594 L -348.593505859375 -322.3073120117188 C -348.6514892578125 -325.9449462890625 -351.650634765625 -328.8667602539062 -355.2882690429688 -328.789306640625 C -358.9259338378906 -328.8473510742188 -361.925048828125 -325.9449462890625 -361.9830932617188 -322.3073120117188 L -361.9830932617188 -319.5403747558594 C -362.021728515625 -318.979248046875 -362.1765747070312 -318.4181823730469 -362.4281311035156 -317.9344482421875 L -363.5697326660156 -316.0962524414062 C -364.0341186523438 -315.4190063476562 -364.1309204101562 -314.5676574707031 -363.8406677246094 -313.793701171875 C -363.5310668945312 -313.0197143554688 -362.892578125 -312.439208984375 -362.0798645019531 -312.2264404296875 C -359.8740234375 -311.5104370117188 -357.571533203125 -311.1428527832031 -355.2690124511719 -311.1622314453125 C -352.9470520019531 -311.1622314453125 -350.6638793945312 -311.5104370117188 -348.4581298828125 -312.2264404296875 C -347.6841430664062 -312.4779052734375 -347.0455932617188 -313.0583801269531 -346.7553405761719 -313.8323364257812 C -346.5231323242188 -314.5676574707031 -346.6005249023438 -315.4190063476562 -347.0261840820312 -316.0962524414062 L -347.0261840820312 -316.0962524414062 Z" fill="#4154b5" fill-opacity="0.4" stroke="none" stroke-width="1" stroke-opacity="0.4" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';
const String _svg_sbycsg =
    '<svg viewBox="11.1 2.2 5.0 1.5" ><path transform="translate(371.91, 331.5)" d="M -355.789306640625 -327.8585815429688 C -356.6019592285156 -328.168212890625 -357.4532775878906 -328.3229675292969 -358.3046264648438 -328.3229675292969 C -359.156005859375 -328.3229675292969 -360.0267333984375 -328.168212890625 -360.8200378417969 -327.8585815429688 C -360.31689453125 -328.7680053710938 -359.3494262695312 -329.3097839355469 -358.3046264648438 -329.3097839355469 C -357.2598266601562 -329.3291625976562 -356.2923583984375 -328.7680053710938 -355.789306640625 -327.8585815429688 Z" fill="#4154b5" stroke="none" stroke-width="1" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';
const String _svg_a7ocmc =
    '<svg viewBox="10.4 21.9 6.4 2.2" ><path transform="translate(371.57, 341.04)" d="M -354.7754516601562 -319.1000061035156 C -355.2785034179688 -317.7843017578125 -356.5555725097656 -316.91357421875 -357.9874267578125 -316.91357421875 C -358.87744140625 -316.91357421875 -359.7481689453125 -317.2618103027344 -360.3866882324219 -317.8809814453125 C -360.7543029785156 -318.2100219726562 -361.025146484375 -318.6356811523438 -361.1799926757812 -319.1000061035156 C -361.0252075195312 -319.0806274414062 -360.8897705078125 -319.0613403320312 -360.7349243164062 -319.0419616699219 C -360.4640197753906 -319.0032958984375 -360.2125244140625 -318.9839477539062 -359.9222412109375 -318.9452514648438 C -359.2837829589844 -318.8872375488281 -358.6258239746094 -318.8485717773438 -357.9679565429688 -318.8485717773438 C -357.3101196289062 -318.8485717773438 -356.6715698242188 -318.8872375488281 -356.0524291992188 -318.9452514648438 C -355.8202514648438 -318.9646301269531 -355.5880737304688 -318.9839477539062 -355.3558959960938 -319.0032958984375 L -354.7754516601562 -319.1000061035156 Z" fill="#4154b5" stroke="none" stroke-width="1" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';
const String _svg_s9d3he =
    '<svg viewBox="0.0 0.0 27.2 26.3" ><path transform="translate(366.55, 330.44)" d="M -366.5499877929688 -330.4400634765625 L -339.3643798828125 -330.4400634765625 L -339.3643798828125 -304.1251220703125 L -366.5499877929688 -304.1251220703125 L -366.5499877929688 -330.4400634765625 Z" fill="none" stroke="none" stroke-width="1" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';
const String _svg_fbrgq1 =
    '<svg viewBox="33.5 4.0 12.5 12.2" ><path transform="translate(382.71, 332.39)" d="M -336.7218017578125 -322.2738647460938 C -336.77978515625 -318.8683776855469 -339.5854797363281 -316.14013671875 -342.9909057617188 -316.1982116699219 C -346.3963623046875 -316.14013671875 -349.2019653320312 -318.8683776855469 -349.260009765625 -322.2738647460938 C -349.2019653320312 -325.6793823242188 -346.3963317871094 -328.4076232910156 -342.9909057617188 -328.3495483398438 C -339.5854797363281 -328.4076232910156 -336.77978515625 -325.6793823242188 -336.7218017578125 -322.2738647460938 Z" fill="#4154b5" stroke="none" stroke-width="1" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';
const String _svg_jjn0al =
    '<svg viewBox="4.2 6.1 39.7 38.5" ><path transform="translate(368.58, 333.37)" d="M -328.8549194335938 -314.1525573730469 C -333.963134765625 -314.094482421875 -338.1618957519531 -318.1578674316406 -338.2586059570312 -323.2660217285156 C -338.2392272949219 -324.6785278320312 -337.8909301757812 -326.0716857910156 -337.2330932617188 -327.3099975585938 L -352.847900390625 -327.3099975585938 C -360.065185546875 -327.3099975585938 -364.3800048828125 -323.1499328613281 -364.3800048828125 -316.1455383300781 L -364.3800048828125 -300.0469665527344 C -364.3800048828125 -293.0232238769531 -360.0458068847656 -288.8438110351562 -352.847900390625 -288.8438110351562 L -336.2269592285156 -288.8438110351562 C -328.9903564453125 -288.8438110351562 -324.6948852539062 -293.0038452148438 -324.6948852539062 -300.0082397460938 L -324.6948852539062 -315.1393432617188 C -325.9913024902344 -314.5008544921875 -327.423095703125 -314.1525573730469 -328.8549194335938 -314.1525573730469 Z" fill="#4154b5" fill-opacity="0.26" stroke="#149f83" stroke-width="1" stroke-opacity="0.26" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';
const String _svg_bon4nd =
    '<svg viewBox="0.0 0.0 50.2 48.6" ><path transform="translate(366.55, 330.44)" d="M -366.5499877929688 -330.4400634765625 L -316.3775939941406 -330.4400634765625 L -316.3775939941406 -281.854248046875 L -366.5499877929688 -281.854248046875 L -366.5499877929688 -330.4400634765625 Z" fill="none" stroke="none" stroke-width="1" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';
const String _svg_ki4182 =
    '<svg viewBox="0.0 0.0 33.7 42.1" ><path transform="translate(258.25, 5.25)" d="M -224.5701141357422 5.274962902069092 L -224.5701141357422 26.32488822937012 C -224.5701141357422 34.74485778808594 -226.6750793457031 36.849853515625 -235.0950622558594 36.849853515625 L -247.7250366210938 36.849853515625 C -256.1449890136719 36.849853515625 -258.25 34.74485778808594 -258.25 26.32488822937012 L -258.25 5.274962902069092 C -258.25 -3.145007133483887 -256.1449890136719 -5.25 -247.7250366210938 -5.25 L -235.0950622558594 -5.25 C -226.6750793457031 -5.25 -224.5701141357422 -3.145007133483887 -224.5701141357422 5.274962902069092 Z" fill="none" stroke="#4154b5" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" /></svg>';
const String _svg_czt67 =
    '<svg viewBox="12.6 7.4 8.4 1.0" ><path transform="translate(264.88, 9.12)" d="M -243.8300170898438 -1.75 L -252.25 -1.75" fill="none" fill-opacity="0.4" stroke="#4154b5" stroke-width="1.5" stroke-opacity="0.4" stroke-linecap="round" stroke-linejoin="round" /></svg>';
const String _svg_b8k0ez =
    '<svg viewBox="13.6 29.5 6.5 6.5" ><path transform="translate(265.38, 20.72)" d="M -245.2745056152344 12.01273822784424 C -245.2745056152344 13.82303142547607 -246.7269287109375 15.27547645568848 -248.5372619628906 15.27547645568848 C -250.3475494384766 15.27547645568848 -251.7999725341797 13.82303428649902 -251.7999725341797 12.01273822784424 C -251.7999725341797 10.20244598388672 -250.3475494384766 8.75 -248.5372619628906 8.75 C -248.5372619628906 8.75 -248.5372619628906 8.75 -248.5372619628906 8.75 C -246.7269287109375 8.75 -245.2745056152344 10.20244407653809 -245.2745056152344 12.01273822784424 Z" fill="none" fill-opacity="0.4" stroke="#4154b5" stroke-width="1.5" stroke-opacity="0.4" stroke-linecap="round" stroke-linejoin="round" /></svg>';
const String _svg_u1tex1 =
    '<svg viewBox="-369.2 -446.2 40.6 38.3" ><path transform="translate(0.0, 0.0)" d="M -346.4620361328125 -444.7433471679688 L -342.3311767578125 -436.5042114257812 C -341.9248657226562 -435.6915893554688 -341.1348266601562 -435.1272583007812 -340.23193359375 -435.014404296875 L -330.99951171875 -433.6825561523438 C -329.5097045898438 -433.4794311523438 -328.4487915039062 -432.1024169921875 -328.6519165039062 -430.6126708984375 C -328.7422485351562 -430.0032348632812 -329.0131225585938 -429.4389038085938 -329.4645385742188 -429.010009765625 L -336.1461181640625 -422.5992431640625 C -336.80078125 -421.9672241210938 -337.09423828125 -421.0643310546875 -336.9362182617188 -420.1614379882812 L -335.3560791015625 -411.109619140625 C -335.1077880859375 -409.59716796875 -336.1461181640625 -408.1751098632812 -337.658447265625 -407.9268188476562 C -338.2454223632812 -407.8364868164062 -338.8548583984375 -407.9268188476562 -339.3965454101562 -408.2202758789062 L -347.6357421875 -412.486572265625 C -348.4483032226562 -412.9154663085938 -349.4190063476562 -412.9154663085938 -350.2316284179688 -412.486572265625 L -358.4707641601562 -408.2202758789062 C -359.8251342773438 -407.4979248046875 -361.4955444335938 -408.01708984375 -362.2178955078125 -409.3715209960938 C -362.5113525390625 -409.9132080078125 -362.6016845703125 -410.5227661132812 -362.5113525390625 -411.109619140625 L -360.9312133789062 -420.1614379882812 C -360.773193359375 -421.0418090820312 -361.066650390625 -421.9672241210938 -361.7213134765625 -422.5767211914062 L -368.4028930664062 -428.9874877929688 C -369.4864501953125 -430.0258178710938 -369.5315551757812 -431.7639770507812 -368.4705810546875 -432.8474731445312 C -368.0416870117188 -433.2989501953125 -367.4773559570312 -433.56982421875 -366.867919921875 -433.6600341796875 L -357.6355590820312 -434.9918823242188 C -356.732666015625 -435.1272583007812 -355.9425659179688 -435.6690063476562 -355.5363159179688 -436.481689453125 L -351.4054565429688 -444.7208251953125 C -350.7056884765625 -446.0977783203125 -349.0126953125 -446.616943359375 -347.6357421875 -445.9171752929688 C -347.1392822265625 -445.69140625 -346.73291015625 -445.2625122070312 -346.4620361328125 -444.7433471679688 Z" fill="none" stroke="#4154b5" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" /></svg>';
const String _svg_puhlg =
    '<svg viewBox="28.4 10.3 6.1 10.3" ><path transform="translate(14.49, 188.18)" d="M 13.96000099182129 -177.8300018310547 C 17.39852142333984 -175.4481964111328 19.64614105224609 -171.6742095947266 20.09902000427246 -167.5144500732422" fill="none" fill-opacity="0.34" stroke="#4154b5" stroke-width="1.5" stroke-opacity="0.34" stroke-linecap="round" stroke-linejoin="round" /></svg>';
const String _svg_c92645 =
    '<svg viewBox="5.9 10.4 6.0 10.3" ><path transform="translate(5.36, 188.21)" d="M 0.4900000095367432 -167.4644470214844 C 0.9093319177627563 -171.6074523925781 3.123404026031494 -175.3814392089844 6.528379440307617 -177.7799987792969" fill="none" fill-opacity="0.34" stroke="#4154b5" stroke-width="1.5" stroke-opacity="0.34" stroke-linecap="round" stroke-linejoin="round" /></svg>';
const String _svg_vhpsw0 =
    '<svg viewBox="13.7 35.1 12.7 1.5" ><path transform="translate(8.55, 198.18)" d="M 5.190000534057617 -163.0600280761719 C 7.202794075012207 -162.0368347167969 9.433639526367188 -161.5168762207031 11.6812572479248 -161.5168762207031 C 13.84500885009766 -161.5168762207031 15.99198913574219 -162.0032958984375 17.93768882751465 -162.942626953125" fill="none" fill-opacity="0.34" stroke="#4154b5" stroke-width="1.5" stroke-opacity="0.34" stroke-linecap="round" stroke-linejoin="round" /></svg>';
const String _svg_j88te =
    '<svg viewBox="15.6 3.6 9.3 9.3" ><path transform="translate(9.29, 185.45)" d="M 15.60594177246094 -177.1970520019531 C 15.60594177246094 -174.6139831542969 13.52605628967285 -172.5340881347656 10.94297027587891 -172.5340881347656 C 8.359886169433594 -172.5340881347656 6.280001163482666 -174.6139831542969 6.280001163482666 -177.1970520019531 C 6.280001163482666 -179.7801208496094 8.359886169433594 -181.8600158691406 10.94297027587891 -181.8600158691406 C 13.52605628967285 -181.8600158691406 15.60594177246094 -179.7801208496094 15.60594177246094 -177.1970520019531 L 15.60594177246094 -177.1970520019531 Z" fill="none" stroke="#4154b5" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" /></svg>';
const String _svg_tpz8b1 =
    '<svg viewBox="3.4 24.1 9.3 9.3" ><path transform="translate(4.39, 193.73)" d="M 8.375941276550293 -164.97705078125 C 8.375941276550293 -162.3939819335938 6.296054840087891 -160.3140869140625 3.712970495223999 -160.3140869140625 C 1.129886269569397 -160.3140869140625 -0.9499998092651367 -162.3939819335938 -0.9499998092651367 -164.97705078125 C -0.9499998092651367 -167.5601196289062 1.129886269569397 -169.6400146484375 3.712970495223999 -169.6400146484375 C 6.296054840087891 -169.6400146484375 8.375941276550293 -167.5601196289062 8.375941276550293 -164.97705078125 L 8.375941276550293 -164.97705078125 Z" fill="none" stroke="#4154b5" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" /></svg>';
const String _svg_aphwv =
    '<svg viewBox="27.5 24.1 9.3 9.3" ><path transform="translate(14.1, 193.73)" d="M 22.7159423828125 -164.97705078125 C 22.7159423828125 -162.3939819335938 20.63605499267578 -160.3140869140625 18.05297088623047 -160.3140869140625 C 15.46988582611084 -160.3140869140625 13.39000034332275 -162.3939819335938 13.39000034332275 -164.97705078125 C 13.39000034332275 -167.5601196289062 15.46988582611084 -169.6400146484375 18.05297088623047 -169.6400146484375 C 20.63605499267578 -169.6400146484375 22.7159423828125 -167.5601196289062 22.7159423828125 -164.97705078125 L 22.7159423828125 -164.97705078125 Z" fill="none" stroke="#4154b5" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" /></svg>';
const String _svg_adb2rz =
    '<svg viewBox="0.0 0.0 40.3 40.3" ><path transform="translate(3.0, 184.0)" d="M -3 -184 L 37.255859375 -184 L 37.255859375 -143.744140625 L -3 -143.744140625 L -3 -184 Z" fill="none" stroke="none" stroke-width="1" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';
const String _svg_t4emgm =
    '<svg viewBox="706.0 -139.8 26.4 21.5" ><path  d="M 725.3599853515625 -139.8399963378906 L 713.0700073242188 -139.8399963378906 C 707.6500244140625 -139.8399963378906 706 -138.1900024414062 706 -132.7699890136719 L 706 -125.3899917602539 C 706 -119.9699935913086 707.6500244140625 -118.3199920654297 713.0700073242188 -118.3199920654297 L 725.3599853515625 -118.3199920654297 C 730.7799682617188 -118.3199920654297 732.4299926757812 -119.9699935913086 732.4299926757812 -125.3899917602539 L 732.4299926757812 -132.7699890136719 C 732.4299926757812 -138.1900024414062 730.780029296875 -139.8399963378906 725.3599853515625 -139.8399963378906 Z M 728.1199951171875 -127.5999984741211 C 728.1199951171875 -124.629997253418 726.72998046875 -123.2399978637695 723.760009765625 -123.2399978637695 L 720.8099975585938 -123.2399978637695 C 717.8400268554688 -123.2399978637695 716.4500122070312 -124.629997253418 716.4500122070312 -127.5999984741211 L 716.4500122070312 -130.5500030517578 C 716.4500122070312 -133.5200042724609 717.8400268554688 -134.9100036621094 720.8099975585938 -134.9100036621094 L 723.760009765625 -134.9100036621094 C 726.72998046875 -134.9100036621094 728.1199951171875 -133.5200042724609 728.1199951171875 -130.5500030517578 L 728.1199951171875 -127.5999984741211 Z" fill="#4154b5" stroke="none" stroke-width="1" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';
const String _svg_e4iue3 =
    '<svg viewBox="710.4 -141.1 24.0 24.0" ><path  d="M 734.4299926757812 -117.0800018310547 L 710.4299926757812 -117.0800018310547 L 710.4299926757812 -141.0800018310547 L 734.4299926757812 -141.0800018310547 L 734.4299926757812 -117.0800018310547 Z" fill="none" stroke="none" stroke-width="1" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';
const String _svg_fp2v3 =
    '<svg viewBox="25.6 9.9 10.8 2.2" ><path transform="translate(-51.45, 412.7)" d="M 86.88574981689453 -400.5545043945312 L 78.05570220947266 -400.5545043945312 C 77.45003509521484 -400.6342163085938 77.00373840332031 -401.1761474609375 77.08343505859375 -401.7977294921875 C 77.14719390869141 -402.3078002929688 77.54566192626953 -402.706298828125 78.05570220947266 -402.7699584960938 L 86.88574981689453 -402.7699584960938 C 87.49141693115234 -402.6903076171875 87.93772125244141 -402.1483764648438 87.85800933837891 -401.5267944335938 C 87.79425811767578 -401.0167846679688 87.39579010009766 -400.6182861328125 86.88574981689453 -400.5545043945312 Z" fill="#4154b5" fill-opacity="0.4" stroke="none" stroke-width="1" stroke-opacity="0.4" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';
const String _svg_nzt1t6 =
    '<svg viewBox="3.3 9.9 8.1 2.2" ><path transform="translate(-59.76, 412.71)" d="M 70.0611572265625 -400.5604248046875 L 64.17976379394531 -400.5604248046875 C 63.57410049438477 -400.5604248046875 63.07999801635742 -401.0545654296875 63.07999801635742 -401.6602172851562 C 63.07999801635742 -402.2659301757812 63.57410049438477 -402.760009765625 64.17976379394531 -402.760009765625 C 64.17976379394531 -402.760009765625 64.17976379394531 -402.760009765625 64.17976379394531 -402.760009765625 L 70.0611572265625 -402.760009765625 C 70.66682434082031 -402.760009765625 71.16093444824219 -402.2659301757812 71.16093444824219 -401.6602172851562 C 71.16093444824219 -401.0545654296875 70.66682434082031 -400.5604248046875 70.0611572265625 -400.5604248046875 C 70.0611572265625 -400.5604248046875 70.0611572265625 -400.5604248046875 70.0611572265625 -400.5604248046875 Z" fill="#4154b5" fill-opacity="0.4" stroke="none" stroke-width="1" stroke-opacity="0.4" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';
const String _svg_yabpx =
    '<svg viewBox="11.5 4.8 12.5 12.5" ><path transform="translate(-56.71, 410.79)" d="M 80.7259521484375 -399.7420043945312 C 80.7259521484375 -396.2992553710938 77.92073059082031 -393.4940185546875 74.47798156738281 -393.4940185546875 C 71.03521728515625 -393.4940185546875 68.22999572753906 -396.2992553710938 68.22999572753906 -399.7420043945312 C 68.22999572753906 -403.184814453125 71.03521728515625 -405.989990234375 74.47798156738281 -405.989990234375 C 74.47798156738281 -405.989990234375 74.47798156738281 -405.989990234375 74.47798156738281 -405.989990234375 C 77.92073059082031 -405.989990234375 80.7259521484375 -403.184814453125 80.7259521484375 -399.7420043945312 Z" fill="none" stroke="#4154b5" stroke-width="1.5" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';
const String _svg_b7clv2 =
    '<svg viewBox="26.9 26.1 8.1 2.2" ><path transform="translate(-50.99, 418.73)" d="M 84.83116149902344 -390.4104919433594 L 78.94977569580078 -390.4104919433594 C 78.34410858154297 -390.4104919433594 77.84999847412109 -390.9045715332031 77.84999847412109 -391.5102233886719 C 77.84999847412109 -392.1159362792969 78.34409332275391 -392.6100158691406 78.94977569580078 -392.6100158691406 C 78.94977569580078 -392.6100158691406 78.94977569580078 -392.6100158691406 78.94977569580078 -392.6100158691406 L 84.83116149902344 -392.6100158691406 C 85.43682861328125 -392.6100158691406 85.93093872070312 -392.1159362792969 85.93093872070312 -391.5102233886719 C 85.93092346191406 -390.9045715332031 85.43682861328125 -390.4104919433594 84.83116149902344 -390.4104919433594 C 84.83116149902344 -390.4104919433594 84.83116149902344 -390.4104919433594 84.83116149902344 -390.4104919433594 Z" fill="#4154b5" fill-opacity="0.4" stroke="none" stroke-width="1" stroke-opacity="0.4" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';
const String _svg_itbzh1 =
    '<svg viewBox="1.7 26.1 11.0 2.2" ><path transform="translate(-60.36, 418.73)" d="M 72.00981903076172 -390.4104919433594 L 63.17977142333984 -390.4104919433594 C 62.5740966796875 -390.4104919433594 62.08000183105469 -390.9045715332031 62.08000183105469 -391.5102233886719 C 62.08000183105469 -392.1159362792969 62.57410430908203 -392.6100158691406 63.17977142333984 -392.6100158691406 C 63.17977142333984 -392.6100158691406 63.17977142333984 -392.6100158691406 63.17977142333984 -392.6100158691406 L 72.00981903076172 -392.6100158691406 C 72.61548614501953 -392.6100158691406 73.10959625244141 -392.1159362792969 73.10959625244141 -391.5102233886719 C 73.10959625244141 -390.9045715332031 72.61550140380859 -390.4104919433594 72.00981903076172 -390.4104919433594 C 72.00981903076172 -390.4104919433594 72.00981903076172 -390.4104919433594 72.00981903076172 -390.4104919433594 Z" fill="#4154b5" fill-opacity="0.4" stroke="none" stroke-width="1" stroke-opacity="0.4" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';
const String _svg_z1c0tg =
    '<svg viewBox="14.2 21.0 12.5 12.5" ><path transform="translate(-55.7, 416.82)" d="M 82.42595672607422 -389.5920104980469 C 82.42595672607422 -386.1492614746094 79.62073516845703 -383.3440246582031 76.177978515625 -383.3440246582031 C 72.73522186279297 -383.3440246582031 69.93000030517578 -386.1492614746094 69.93000030517578 -389.5920104980469 C 69.93000030517578 -393.0348205566406 72.73522186279297 -395.8399963378906 76.177978515625 -395.8399963378906 C 76.177978515625 -395.8399963378906 76.177978515625 -395.8399963378906 76.177978515625 -395.8399963378906 C 79.62075042724609 -395.8399963378906 82.42595672607422 -393.0347595214844 82.42595672607422 -389.5920104980469 Z" fill="#4154b5" stroke="#4154b5" stroke-width="1.5" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';
const String _svg_xxwfp =
    '<svg viewBox="0.0 0.0 38.3 38.3" ><path transform="translate(-61.0, 409.0)" d="M 61 -409 L 99.2529296875 -409 L 99.2529296875 -370.7470703125 L 61 -370.7470703125 L 61 -409 Z" fill="none" stroke="none" stroke-width="1" stroke-miterlimit="4" stroke-linecap="butt" /></svg>';
